"""
2. Дан список: [‘Ivan’, ‘Ivanou’], и 2 строки: Minsk, Belarus
Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”
"""

first_last_name = ['Ivan', 'Ivanou']
city = 'Minsk'
country = 'Belarus'

print(f'Привет, {first_last_name[0]} {first_last_name[1]}! '
      f'Добро пожаловать в {city} {country}')
