# Напишите программу которая удаляет пробел в начале, в конце строки
str = " See you in 10 min "
print(str.strip())
