# Напишите программу, которая добавляет ‘ing’ к словам.
word = "salt", "dog", "bootle", 'eat', 'open'
new_word = []
for k in word:
    new_word.append(k + 'ing')
print(new_word)
