"""
Дан список: [‘Ivan’, ‘Ivanou’], и 2 строки: Minsk, Belarus
Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”
"""
name_sur = ['Ivan', 'Ivanou']
loc_c = str("Minsk")
loc_city = 'Belatus'
print(f'Привет, {" ".join(name_sur)}! Добро пожаловать в {loc_c} {loc_city}')
